Revit 2027 API
BuiltInFailures.StairRampFailures.WinderTooManyEndParallelTreadsOrRunWidthFailure Property
 The number of parallel treads at end is too great or the run width is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WinderTooManyEndParallelTreadsOrRunWidthFailure { get; }
Public Shared ReadOnly Property WinderTooManyEndParallelTreadsOrRunWidthFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WinderTooManyEndParallelTreadsOrRunWidthFailure {
	FailureDefinitionId^ get ();
}
static member WinderTooManyEndParallelTreadsOrRunWidthFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace